# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3 
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()
import pandas as pd

In [ ]:
#Your code here; create the connection and cursor

## Select the Average Number of Orders on a Product by Product Basis

In [4]:
c.execute("""select AVG(productName)
             from orders
             join orderdetails using(orderNumber)
             join products using(productCode)
             group by 2;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

     AVG(orderNumber)                                  productName
0        10260.035714          18th Century Vintage Horse Carriage
1        10257.444444                        18th century schooner
2        10263.785714                       1900s Vintage Bi-Plane
3        10264.821429                      1900s Vintage Tri-Plane
4        10257.111111                            1903 Ford Model A
5        10257.333333                          1904 Buick Runabout
6        10246.840000                           1911 Ford Town Car
7        10257.814815             1912 Ford Model T Delivery Wagon
8        10260.107143                  1913 Ford Model T Speedster
9        10246.760000                     1917 Grand Touring Sedan
10       10259.928571                     1917 Maxwell Touring Car
11       10261.071429                        1926 Ford Fire Engine
12       10264.642857             1928 British Royal Navy Airplane
13       10264.785714                     1928 Ford Phaeton Deluxe
14       10259.178571                       1928 Mercedes-Benz SSK
15       10264.642857                 1930 Buick Marquette Phaeton
16       10246.720000          1932 Alfa Romeo 8C2300 Spider Sport
17       10258.785714                    1932 Model A Ford J-Coupe
18       10260.000000                           1934 Ford V8 Coupe
19       10260.178571                        1936 Chrysler Airflow
20       10265.500000          1936 Harley Davidson El Knucklehead
21       10247.080000             1936 Mercedes Benz 500k Roadster
22       10259.535714     1936 Mercedes-Benz 500K Special Roadster
23       10263.821429                    1937 Horch 930V Limousine
24       10259.428571                         1937 Lincoln Berline
25       10259.071429    1938 Cadillac V-16 Presidential Limousine
26       10260.750000                      1939 Cadillac Limousine
27       10258.857143                  1939 Chevrolet Deluxe Coupe
28       10263.285714                     1940 Ford Delivery Sedan
29       10260.428571                       1940 Ford Pickup Truck
..                ...                                          ...
79       10263.148148                             1995 Honda Civic
80       10265.428571                        1996 Moto Guzzi 1100i
81       10260.892857  1996 Peterbilt 379 Stake Bed with Outrigger
82       10265.142857                             1997 BMW F650 ST
83       10265.678571                            1997 BMW R 1100 S
84       10261.892857               1998 Chrysler Plymouth Prowler
85       10254.720000                 1999 Indy 500 Monte Carlo SS
86       10263.464286                       1999 Yamaha Speed Boat
87       10256.592593                            2001 Ferrari Enzo
88       10255.360000                          2002 Chevy Corvette
89       10265.964286                             2002 Suzuki XREO
90       10261.629630                           2002 Yamaha YZR M1
91       10265.571429         2003 Harley-Davidson Eagle Drag Bike
92       10265.000000                                ATA: B757-300
93       10264.321429               America West Airlines B757-200
94       10264.642857                  American Airlines: B767-300
95       10264.178571                    American Airlines: MD-11S
96       10263.821429                             Boeing X-32A JSF
97       10257.111111                     Collectable Wooden Train
98       10264.142857                     Corsair F4U ( Bird Cage)
99       10262.142857             Diamond T620 Semi-Skirted Tanker
100      10264.535714                           F/A 18 Hornet 1/72
101      10263.785714                                   HMS Bounty
102      10264.714286                               P-51-D Mustang
103      10257.666667                                   Pont Yacht
104      10257.296296                                The Mayflower
105      10257.703704                               The Queen Mary
106      10257.814815                        The Schooner Bluenose
107      10257.777778                                  The Titanic
108      10258.037037                    The USS Constitution Ship

[109 rows x 2 columns]

In [4]:
#Your code here; use a subquery. No join will be necessary.
 c.execute("""select AVG(numOrders)
                    from (select productCode,
                                 count(distinct orderNumber) as numOrders
                                 from products
                                 join orderdetails
                                 using(productCode)
                                 group by 1
                         );
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

109

  productCode  avg(quantityordered)
0    S10_1678             37.750000
1    S10_1949             34.321429
2    S10_2016             35.678571
3    S10_4698             35.178571
4    S10_4757             36.785714

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [5]:
#Your code here; use a subquery. No join will be necessary.
c.execute("""select customerNumber, contactLastName, ContactFirstName
                    from customers
                    where customerNumber in (select customerNumber from orders where orderDate = "2003-01-31");
          """
         )
df = pd.DataFrame(c.fetchall())
df. columns = [i[0] for i in c.description]
print(len(df))
df.head()

1

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

In [6]:
c.execute("""select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';""")
df = pd.DataFrame(c.fetchall())
df. columns = [i[0] for i in c.description]
print(len(df))
df.head()

1

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [9]:
#Your code here

c.execute("""select productName,
                      count(quantityordered) as Total_Number_Orders
                      from orderdetails
                      join products
                      using(productCode)
                      group by 1
                      order by count(quantityordered);""")
 
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

                           productName  Total_Number_Orders
0                    1952 Citroen-15CV                   24
1                1957 Ford Thunderbird                   24
2                   1911 Ford Town Car                   25
3             1917 Grand Touring Sedan                   25
4  1932 Alfa Romeo 8C2300 Spider Sport                   25

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [17]:
#Your code here
#c.execute("""select productName, count(distinct customerNumber),
#                      from products
#                      join orderdetails
#                      using(productCode)
#                      join orders
#                      using(orderNumber)
#                      join customers
#                      using(customernumber)
#                      group by 1
#                      order by count(distinct customerNumber);""")
 
c.execute("""select productName,
                    count(distinct customerNumber) numPurchasers
                    from products
                    join orderdetails
                    using(productCode)
                    join orders
                    using (orderNumber)
                    group by 1
                    order by numPurchasers desc
                    ;
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

                   productName  numPurchasers
0  1992 Ferrari 360 Spider red             40
1           1934 Ford V8 Coupe             27
2     1952 Alpine Renault 1300             27
3          1972 Alfa Romeo GTA             27
4             Boeing X-32A JSF             27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [18]:
#Your code here
c.execute("""select distinct employeeNumber,
                    officeCode,
                    o.city,
                    firstName,
                    lastName
                    from employees e
                    join offices o
                    using(officeCode)
                    join customers c
                    on e.employeeNumber = c.salesRepEmployeeNumber
                    join orders
                    using (customerNumber)
                    join orderdetails
                    using (orderNumber)
                    where productCode in (select productCode
                                                 from products
                                                 join orderdetails
                                                 using (productCode)
                                                 join orders
                                                 using (orderNumber)
                                                 group by 1
                                                 having count(distinct customerNumber) <= 20
                                         );
           """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   employeeNumber officeCode           city firstName   lastName
0            1370          4          Paris    Gerard  Hernandez
1            1401          4          Paris    Pamela   Castillo
2            1621          5          Tokyo      Mami      Nishi
3            1501          7         London     Larry       Bott
4            1337          4          Paris      Loui     Bondur
5            1286          3            NYC  Foon Yue      Tseng
6            1166          1  San Francisco    Leslie   Thompson
7            1165          1  San Francisco    Leslie   Jennings
8            1612          6         Sydney     Peter      Marsh
9            1188          2         Boston     Julie   Firrelli
10           1611          6         Sydney      Andy     Fixter
11           1323          3            NYC    George     Vanauf
12           1702          4          Paris    Martin     Gerard
13           1504          7         London     Barry      Jones
14           1216          2         Boston     Steve  Patterson

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here
c.execute("""select employeeNumber,
                    firstName,
                    lastName,
                    count(distinct customerNumber)
                    from employees e
                    join customers c
                    on e.employeeNumber = c.salesRepEmployeeNumber
                    group by 1,2,3
                    having AVG(creditLimit) > 15000;
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!